---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.Append(Autodesk.Revit.DB.Phase)
source: html/03da0af3-6e92-5117-143f-3f4cb3b98e24.htm
---
# Autodesk.Revit.DB.PhaseArray.Append Method

Add the phase to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Phase item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Phase`) - The phase to be added.